FA18/MA300/induction.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [11pt, oneside]
#+LATEX_HEADER: \usepackage{amsmath,amsthm,amsfonts,amssymb,amsxtra}
#+LATEX_HEADER: \pagestyle{empty}
#+LATEX_HEADER: \setlength{\textwidth}{7in}
#+LATEX_HEADER: \setlength{\oddsidemargin}{-0.5in}
#+LATEX_HEADER: \setlength{\topmargin}{-1.0in}
#+LATEX_HEADER: \setlength{\textheight}{9.5in}
#+OPTIONS: toc:nil

* Problems in Chapter 10
** Prove the following statements with either induction, strong induction or proof by small counterexample.
*** For every integer \( n \in \mathbb{N}, \) it follows that \( 1+2+3+4+\dotsb +n = \frac{n^2+n}{2}. \)
    - Preparation. \( (n+1)^2+(n+1) = n^2 + 1 + 2n + n + 1 = n^2+3n+2. \)
    - Basis step: \( 1 = \frac{1^2+1}{2} \)
    - Inductive step: \( \sum_{k=1}^{n+1} k = (n+1) + \sum_{k=1}^n k = (n+1) + \frac{n^2+n}{2} =
      \frac{2n+2+n^2+n}{2} = \frac{n^2+3n+2}{2} = \frac{(n+1)^2+(n+1)}{2}. \)
*** For every integer \( n \in \mathbb{N}, \) it follows that \( 1^2 + 2^2 + 3^2 + 4^2 + \dotsb + n^2 = \frac{ n(n+1)(2n+1) }{6}. \)
    - Preparation. \( (n+1)(n+2)(2n+3) = (n^2+3n+2)(2n+3) = 2n^3+9n^2+13n+6. \)
    - Preparation (easier). \( (n+2)(2n+3) = 2n^2+7n+6. \)
    - Basis step: \( 1 = \frac{1\cdot 2\cdot 3}{6}. \)
    - Inductive step: \( \sum_{k=1}^{n+1} k^2 = (n+1)^2 + \sum_{k=1}^n k^2 = (n+1)^2 + \frac{n(n+1)(2n+1)}{6}
      = \frac{ 6(n+1)^2 + n(n+1)(2n+1)}{6} = (n+1) \frac{ 6(n+1)+ n(2n+1) }{6} = (n+1) \frac{2n^2+7n+6}{6}. \)
*** For every integer \( n \in \mathbb{N}, \) it follows that \( 1^3 + 2^3 + 3^3 + 4^3 + \dotsb + n^3 = \frac{n^2(n+1)^2}{4}. \)
    - Preparation. \( (n+2)^2 = n^2 + 4n + 4 = 4(n+1) + n^2. \)
    - Basis step: \( 1^3 = \frac{1^2\cdot 2^2}{4}. \)
    - Inductive step: \( sum_{k=1}^{n+1} k^3 = (n+1)^3 + \sum_{k=1}^n k^3 = (n+1)^3 + \frac{n^2(n+1)^2}{4} =
      (n+1)^2 \frac{ 4(n+1) + n^2 }{4} = \frac{(n+1)^2(n+2)^2}{4}. \)
*** If \( n \in \mathbb{N}, \) then \( 1\cdot 2 + 2\cdot 3 + 3\cdot 4 + 4\cdot 5 + \dotsb + n(n+1) = \frac{n(n+1)(n+2)}{3}. \)
    - Direct. \( \sum_{k=1}^n k(k+1) = \sum_{k=1}^n (k^2 + k) = \frac{n(n+1)(2n+1)}{6} + \frac{n(n+1)}{2} =
      n(n+1)\frac{2n+1+3}{6} = \n(n+1)\frac{n+2}{3}. \) 
    - Basis step: \( 1\cdot 2 = \frac{1 \cdot 2 \cdot 3}{3}. \)
    - Inductive step: \( \sum_{k=1}^{n+1} k(k+1) = (n+1)(n+2) + \sum_{k=1}^n k(k+1) = (n+1)(n+2) +
      \frac{n(n+1)(n+2)}{3} = (n+1)(n+2) \frac{ 3 + n }{3}. \)
*** If \( n \in \mathbb{N}, \) then \( 2^1 + 2^2 + 2^3 + \dotsb + 2^n = 2^{n+1}-2. \)
    - Basis step: \( 2^1 = 2^2-2. \)
    - Inductive step: \( \sum_{k=1}^{n+1} 2^k = 2^{n+1} + \sum_{k=1}^n 2^k = 2^{n+1} + 2^{n+1}-2 =
      2^{n+2} - 2. \)
*** For every natural number \( n, \) it follows that \( \sum_{k=1}^n (8k-5) = 4n^2-n. \)
    - Direct. \( \sum_{k=1}^n (8k-5) = 8\sum_{k=1}^n k - 5n = 4n(n+1) - 5n = 4n^2 -n. \)
    - Preparation. \( 4(n+1)^2-(n+1) = 4(n^2+1+2n)-n-1 = 4n^2+7n+3. \)
    - Basis step: \( 3 = 4-1. \)
    - Inductive step: \( \sum_{k=1}^{n+1} (8k-5) = 8(n+1)-5 + \sum_{k=1}^n (8k-5) = 8n+3 + 4n^2-n =
      4n^2+7n+3 = 4(n+1)^2-(n+1). \)
*** If \( n \in \mathbb{N}, \) then \( 1\cdot 3 + 2\cdot 4 + 3\cdot 5 + 4\cdot 6 + \dotsb + n(n+2) = \frac{n(n+1)(2n+7)}{6}. \)
    - Similar to previous.
*** If \( n \in \mathbb{N}, \) then \( \frac{1}{2!} + \frac{2}{3!} + \frac{3}{4!} + \dotsb + \frac{n}{(n+1)!} = 1 - \frac{1}{(n+1)!}. \)
    - Basis step: \( \frac{1}{2!} = 1 - \frac{1}{2}. \)
    - Inductive step: \( \sum_{k=1}^{n+1} \frac{k}{(k+1)!} = \frac{n+1}{(n+2)!} + \sum_{k=1}^n
      \frac{k}{(k+1)!} = \frac{n+1}{(n+2)!} + 1 - \frac{1}{(n+1)!} = 1 + \frac{n+1}{(n+2)!} - \frac{n+2}{(n+2)!} = 1 -
      \frac{1}{(n+2)!}. \)
*** For any integer \( n \geq 0, \) it follows that \( 24 \vert (5^{2n}-1). \)
    - Basis step: For \( n=0, 5^{2\cdot 0}-1 = 0, \) which is divisible by 24.
    - Inductive step: \( 5^{2(n+1)}-1 = 25\cdot 5^{2n} - 1 = 25 (5^{2n}-1+1) - 1 = 25 (5^{2n}-1) + 24. \)
*** For any integer \( n \geq 0, \) it follows that \( 3 \vert (5^{2n}-1). \)
    - Basis step as in previous problem.
    - Inductive step: \( 5^{2(n+1)}-1 = 25 (5^{2n-1}-1) + 3\cdot 8. \)
*** For any integer \( n \geq 0, \) it follows that \( 3 \vert (n^3+5n+6). \)
    - Basis step: For \( n=0, 0^3+5\cdot 0 + 6 = 2\cdot 3. \)
    - Inductive step: \( (n+1)^3+5(n+1)+6 = (n^3+3n^2+3n+1) + 5n + 11 = n^3 + 3n^2 + 8n + 12 = (n^3+5n+6) + 3n^2 + 3n +
      6 = (n^3+5n+6) + 3(n^2+n+2). \)
*** For any integer \( n \geq 0, \) it follows that \( 9 \vert (4^{3n}+8). \)
    - Basis step: For \( n=0, 4^0+8 = 9. \)
    - Inductive step: \( 4^{3(n+1)} + 8 = 4^{3n+3} + 8 = 64\cdot 4^{3n} + 8 = 64 (4^{3n} + 8 - 8) + 8 = 64 (4^{3n}+8) +
      8 - 64\cdot 8 = 64(4^{3n}+8) - 504 = 64(4^{3n}+8) - 9\cdot 56. \)
*** For any integer \( n \geq 0. \) it follows that \( 6 \vert (n^3-n). \)
    - Same thing as previous.
*** Suppose that \( a \in \mathbb{Z}.  \) Prove that \( 5 \vert 2^n a \) implies \( 5 \vert a \) for any \( n \in \mathbb{N}. \)
    - Let's rewrite this one: \( \forall n \in \mathbb{N}, P(a,n), \) where \( P(a,n) \) means "\( 5 \vert 2^n a
      \implies 5 \vert a. \)"
    - For this one we are going to use *Strong Induction*, where we assume true all statements \( P(a,k) \) for \( 1
      \leq k \leq n. \)
    - Basis step: We have to prove that \( 5 \vert a \implies 5 \vert a \).  Trivial.
    - The inductive hypothesis here is that for a particular \( n \in \mathbb{N}, \) it is true that \( 5 \vert 2^n a
      \implies 5 \vert a. \)
    - Inductive step.  We have to prove for \( n+1 \) that \( 5 \vert 2^{n+1} a \implies 5 \vert a. \)
    - Let's try using a direct proof: 
    #+attr_latex: :align |l|l|
    |-----------------------------------------------+------------------------------------|
    | \( 5 \vert 2^{n+1}a \)                        | hypothesis                         |
    |-----------------------------------------------+------------------------------------|
    | \( \exists b \in \mathbb{Z}, 2^{n+1}a = 5b \) | definition                         |
    |-----------------------------------------------+------------------------------------|
    | \( 2^{n}(2a) = 5b \)                          | rewriting expression               |
    |-----------------------------------------------+------------------------------------|
    | \( 5 \vert 2^{n} (2a) \)                      | rewriting as in \( P(2a,n) \)      |
    |-----------------------------------------------+------------------------------------|
    | \( 5 \vert 2a \)                              | Induction hypothesis for \( k=n \) |
    |-----------------------------------------------+------------------------------------|
    | \( 5 \vert 2^{1}a \)                          | rewriting                          |
    |-----------------------------------------------+------------------------------------|
    | \( 5 \vert a \)                               | Induction hypothesis for \( k=1 \) |
    |-----------------------------------------------+------------------------------------|
*** If \( n \in \mathbb{N}, \) then \( \frac{1}{1\cdot 2} + \frac{1}{2\cdot 3} + \frac{1}{3\cdot 4} + \frac{1}{4\cdot 5} + \dotsb + \frac{1}{n(n+1)} = 1 - \frac{1}{n+1}. \)
    - Basis step: \( \frac{1}{1\cdot 2} = 1 - \frac{2}. \)
    - Inductive step: \( \sum_{k=1}^{n+1} \frac{1}{k(k+1)} = \frac{1}{(n+1)(n+2)} + \sum_{k=1}^n \frac{1}{k(k+1)} =
      \frac{1}{(n+1)(n+2)} + 1 - \frac{1}{n+1} = 1 + \frac{1}{(n+1)(n+2)} - \frac{n+2}{(n+1)(n+2)} = 1 -
      \frac{n+1}{(n+1)(n+2)}. \)
