FA18/MA300/induction.tex
% Created 2018-11-18 Sun 22:14
% Intended LaTeX compiler: pdflatex
\documentclass[11pt, oneside]{amsart}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsmath,amsthm,amsfonts,amssymb,amsxtra}
\pagestyle{empty}
\setlength{\textwidth}{7in}
\setlength{\oddsidemargin}{-0.5in}
\setlength{\topmargin}{-1.0in}
\setlength{\textheight}{9.5in}
\author{Francisco J. Blanco-Silva}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Francisco J. Blanco-Silva},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}


\section{Problems in Chapter 10}
\label{sec:org1dc036f}
\subsection{Prove the following statements with either induction, strong induction or proof by small counterexample.}
\label{sec:org6ba4644}
\begin{enumerate}
\item For every integer \(n \in \mathbb{N},\) it follows that \(1+2+3+4+\dotsb +n = \frac{n^2+n}{2}.\)
\label{sec:org2cf41db}
\begin{itemize}
\item Preparation. \((n+1)^2+(n+1) = n^2 + 1 + 2n + n + 1 = n^2+3n+2.\)
\item Basis step: \(1 = \frac{1^2+1}{2}\)
\item Inductive step: \(\sum_{k=1}^{n+1} k = (n+1) + \sum_{k=1}^n k = (n+1) + \frac{n^2+n}{2} =
      \frac{2n+2+n^2+n}{2} = \frac{n^2+3n+2}{2} = \frac{(n+1)^2+(n+1)}{2}.\)
\end{itemize}
\item For every integer \(n \in \mathbb{N},\) it follows that \(1^2 + 2^2 + 3^2 + 4^2 + \dotsb + n^2 = \frac{ n(n+1)(2n+1) }{6}.\)
\label{sec:org93a8054}
\begin{itemize}
\item Preparation. \((n+1)(n+2)(2n+3) = (n^2+3n+2)(2n+3) = 2n^3+9n^2+13n+6.\)
\item Preparation (easier). \((n+2)(2n+3) = 2n^2+7n+6.\)
\item Basis step: \(1 = \frac{1\cdot 2\cdot 3}{6}.\)
\item Inductive step: \(\sum_{k=1}^{n+1} k^2 = (n+1)^2 + \sum_{k=1}^n k^2 = (n+1)^2 + \frac{n(n+1)(2n+1)}{6}
      = \frac{ 6(n+1)^2 + n(n+1)(2n+1)}{6} = (n+1) \frac{ 6(n+1)+ n(2n+1) }{6} = (n+1) \frac{2n^2+7n+6}{6}.\)
\end{itemize}
\item For every integer \(n \in \mathbb{N},\) it follows that \(1^3 + 2^3 + 3^3 + 4^3 + \dotsb + n^3 = \frac{n^2(n+1)^2}{4}.\)
\label{sec:orgfb47b3d}
\begin{itemize}
\item Preparation. \((n+2)^2 = n^2 + 4n + 4 = 4(n+1) + n^2.\)
\item Basis step: \(1^3 = \frac{1^2\cdot 2^2}{4}.\)
\item Inductive step: \(sum_{k=1}^{n+1} k^3 = (n+1)^3 + \sum_{k=1}^n k^3 = (n+1)^3 + \frac{n^2(n+1)^2}{4} =
      (n+1)^2 \frac{ 4(n+1) + n^2 }{4} = \frac{(n+1)^2(n+2)^2}{4}.\)
\end{itemize}
\item If \(n \in \mathbb{N},\) then \(1\cdot 2 + 2\cdot 3 + 3\cdot 4 + 4\cdot 5 + \dotsb + n(n+1) = \frac{n(n+1)(n+2)}{3}.\)
\label{sec:orgfdcdb68}
\begin{itemize}
\item Direct. \(\sum_{k=1}^n k(k+1) = \sum_{k=1}^n (k^2 + k) = \frac{n(n+1)(2n+1)}{6} + \frac{n(n+1)}{2} =
      n(n+1)\frac{2n+1+3}{6} = \n(n+1)\frac{n+2}{3}.\)
\item Basis step: \(1\cdot 2 = \frac{1 \cdot 2 \cdot 3}{3}.\)
\item Inductive step: \(\sum_{k=1}^{n+1} k(k+1) = (n+1)(n+2) + \sum_{k=1}^n k(k+1) = (n+1)(n+2) +
      \frac{n(n+1)(n+2)}{3} = (n+1)(n+2) \frac{ 3 + n }{3}.\)
\end{itemize}
\item If \(n \in \mathbb{N},\) then \(2^1 + 2^2 + 2^3 + \dotsb + 2^n = 2^{n+1}-2.\)
\label{sec:org67f2ba8}
\begin{itemize}
\item Basis step: \(2^1 = 2^2-2.\)
\item Inductive step: \(\sum_{k=1}^{n+1} 2^k = 2^{n+1} + \sum_{k=1}^n 2^k = 2^{n+1} + 2^{n+1}-2 =
      2^{n+2} - 2.\)
\end{itemize}
\item For every natural number \(n,\) it follows that \(\sum_{k=1}^n (8k-5) = 4n^2-n.\)
\label{sec:org5f78cb0}
\begin{itemize}
\item Direct. \(\sum_{k=1}^n (8k-5) = 8\sum_{k=1}^n k - 5n = 4n(n+1) - 5n = 4n^2 -n.\)
\item Preparation. \(4(n+1)^2-(n+1) = 4(n^2+1+2n)-n-1 = 4n^2+7n+3.\)
\item Basis step: \(3 = 4-1.\)
\item Inductive step: \(\sum_{k=1}^{n+1} (8k-5) = 8(n+1)-5 + \sum_{k=1}^n (8k-5) = 8n+3 + 4n^2-n =
      4n^2+7n+3 = 4(n+1)^2-(n+1).\)
\end{itemize}
\item If \(n \in \mathbb{N},\) then \(1\cdot 3 + 2\cdot 4 + 3\cdot 5 + 4\cdot 6 + \dotsb + n(n+2) = \frac{n(n+1)(2n+7)}{6}.\)
\label{sec:org9c92794}
\begin{itemize}
\item Similar to previous.
\end{itemize}
\item If \(n \in \mathbb{N},\) then \(\frac{1}{2!} + \frac{2}{3!} + \frac{3}{4!} + \dotsb + \frac{n}{(n+1)!} = 1 - \frac{1}{(n+1)!}.\)
\label{sec:orgbb775d7}
\begin{itemize}
\item Basis step: \(\frac{1}{2!} = 1 - \frac{1}{2}.\)
\item Inductive step: \(\sum_{k=1}^{n+1} \frac{k}{(k+1)!} = \frac{n+1}{(n+2)!} + \sum_{k=1}^n
      \frac{k}{(k+1)!} = \frac{n+1}{(n+2)!} + 1 - \frac{1}{(n+1)!} = 1 + \frac{n+1}{(n+2)!} - \frac{n+2}{(n+2)!} = 1 -
      \frac{1}{(n+2)!}.\)
\end{itemize}
\item For any integer \(n \geq 0,\) it follows that \(24 \vert (5^{2n}-1).\)
\label{sec:orgaa5ff7f}
\begin{itemize}
\item Basis step: For \(n=0, 5^{2\cdot 0}-1 = 0,\) which is divisible by 24.
\item Inductive step: \(5^{2(n+1)}-1 = 25\cdot 5^{2n} - 1 = 25 (5^{2n}-1+1) - 1 = 25 (5^{2n}-1) + 24.\)
\end{itemize}
\item For any integer \(n \geq 0,\) it follows that \(3 \vert (5^{2n}-1).\)
\label{sec:org3c39ed5}
\begin{itemize}
\item Basis step as in previous problem.
\item Inductive step: \(5^{2(n+1)}-1 = 25 (5^{2n-1}-1) + 3\cdot 8.\)
\end{itemize}
\item For any integer \(n \geq 0,\) it follows that \(3 \vert (n^3+5n+6).\)
\label{sec:org8c2bfe6}
\begin{itemize}
\item Basis step: For \(n=0, 0^3+5\cdot 0 + 6 = 2\cdot 3.\)
\item Inductive step: \((n+1)^3+5(n+1)+6 = (n^3+3n^2+3n+1) + 5n + 11 = n^3 + 3n^2 + 8n + 12 = (n^3+5n+6) + 3n^2 + 3n +
      6 = (n^3+5n+6) + 3(n^2+n+2).\)
\end{itemize}
\item For any integer \(n \geq 0,\) it follows that \(9 \vert (4^{3n}+8).\)
\label{sec:org448584f}
\begin{itemize}
\item Basis step: For \(n=0, 4^0+8 = 9.\)
\item Inductive step: \(4^{3(n+1)} + 8 = 4^{3n+3} + 8 = 64\cdot 4^{3n} + 8 = 64 (4^{3n} + 8 - 8) + 8 = 64 (4^{3n}+8) +
      8 - 64\cdot 8 = 64(4^{3n}+8) - 504 = 64(4^{3n}+8) - 9\cdot 56.\)
\end{itemize}
\item For any integer \(n \geq 0.\) it follows that \(6 \vert (n^3-n).\)
\label{sec:org34a66d5}
\begin{itemize}
\item Same thing as previous.
\end{itemize}
\item Suppose that \(a \in \mathbb{Z}.\) Prove that \(5 \vert 2^n a\) implies \(5 \vert a\) for any \(n \in \mathbb{N}.\)
\label{sec:org785f3e2}
\begin{itemize}
\item Let's rewrite this one: \(\forall n \in \mathbb{N}, P(a,n),\) where \(P(a,n)\) means "\(5 \vert 2^n a
      \implies 5 \vert a.\)"
\item For this one we are going to use \textbf{Strong Induction}, where we assume true all statements \(P(a,k)\) for \(1
      \leq k \leq n.\)
\item Basis step: We have to prove that \(5 \vert a \implies 5 \vert a\).  Trivial.
\item The inductive hypothesis here is that for a particular \(n \in \mathbb{N},\) it is true that \(5 \vert 2^n a
      \implies 5 \vert a.\)
\item Inductive step.  We have to prove for \(n+1\) that \(5 \vert 2^{n+1} a \implies 5 \vert a.\)
\item Let's try using a direct proof:
\end{itemize}
\begin{center}
\begin{tabular}{|l|l|}
\hline
\(5 \vert 2^{n+1}a\) & hypothesis\\
\hline
\(\exists b \in \mathbb{Z}, 2^{n+1}a = 5b\) & definition\\
\hline
\(2^{n}(2a) = 5b\) & rewriting expression\\
\hline
\(5 \vert 2^{n} (2a)\) & rewriting as in \(P(2a,n)\)\\
\hline
\(5 \vert 2a\) & Induction hypothesis for \(k=n\)\\
\hline
\(5 \vert 2^{1}a\) & rewriting\\
\hline
\(5 \vert a\) & Induction hypothesis for \(k=1\)\\
\hline
\end{tabular}
\end{center}
\item If \(n \in \mathbb{N},\) then \(\frac{1}{1\cdot 2} + \frac{1}{2\cdot 3} + \frac{1}{3\cdot 4} + \frac{1}{4\cdot 5} + \dotsb + \frac{1}{n(n+1)} = 1 - \frac{1}{n+1}.\)
\label{sec:org62b53e5}
\begin{itemize}
\item Basis step: \(\frac{1}{1\cdot 2} = 1 - \frac{2}.\)
\item Inductive step: \(\sum_{k=1}^{n+1} \frac{1}{k(k+1)} = \frac{1}{(n+1)(n+2)} + \sum_{k=1}^n \frac{1}{k(k+1)} =
      \frac{1}{(n+1)(n+2)} + 1 - \frac{1}{n+1} = 1 + \frac{1}{(n+1)(n+2)} - \frac{n+2}{(n+1)(n+2)} = 1 -
      \frac{n+1}{(n+1)(n+2)}.\)
\end{itemize}
