FA18/MA300/induction.org
*** For every natural number \( n, \) it follows that \( 2^n +1 \leq 3^n. \)
    - Basis step: \( 2+1 = 3. \)
    - Inductive step: 
      \begin{align*}
      2^{n+1} + 1 &= 2 \cdot 2^n + 1 = 2 (2^n+1-1) + 1 &&         \\
      &= 2 (2^n+1) - 1            &&\text{(rewrite)}              \\
      &\leq 2\cdot 3^n - 1        &&\text{(inductive hypothesis)} \\
      &\leq 2\cdot 3^n            &&\text{(obvious, no?)}         \\
      &\leq 3\cdot 3^n = 3^{n+1}  &&\text{(lol!)}
      \end{align*}
*** Suppose \( A_1, A_2, \dotsc, A_n \) are sets in some universal set \( U, \) and \( n \geq 2. \)  Prove that 
    \begin{equation*}
    (A_1 \cap A_2 \cap \dotsb \cap A_n)^\complement = A_1^\complement \cup A_2^\complement \cup \dotsb \cup
    A_n^\complement.
    \end{equation*}
    - Basis step: \( (A_1 \cap A_2)^\complement = A_1^\complement \cup A_2^\complement \) by de Morgan's Laws.
    - Inductive step: \( \big( \bigcap_{k=1}^{n+1} A_k \big)^\complement = \big( \bigcap_{k=1}^n A_k
      \big)^\complement \cup A_{n+1}^\complement. \)
*** Suppose \( A_1, A_2, \dotsc, A_n \) are sets in some universal set \( U, \) and \( n \geq 2. \)  Prove that 
    \begin{equation*}
    \((A_1 \cup A_2 \cup \dotsb \cup A_n)^\complement = A_1^\complement \cap A_2^\complement \cap \dotsb \cap
    A_n^\complement.
    \end{equation*}
    - Exactly as the previous problem.
*** Prove that \( \frac{1}{1} + \frac{1}{4} + \frac{1}{9} + \dotsb + \frac{1}{n^2} \leq 2 - \frac{1}{n}. \)
    - Basic step: \( 1 = 2 - 1. \)
    - Inductive step:
      \begin{align*}
      \sum_{k=1}^{n+1} \frac{1}{k^2} &= \frac{1}{(n+1)^2} + \sum_{k=1}^n \frac{1}{k^2} && \\
      &\leq \frac{1}{(n+1)^2} + 2 - \frac{1}{n}  &&\text{(inductive hypothesis)} \\
      &= 2 + \frac{n}{n(n+1)^2} - \frac{(n+1)^2}{n(n+1)^2} && \\
      &= 2 - \frac{n^2+n+1}{n(n+1)^2}  && \\
      &= 2 - \frac{n^2+n}{n(n+1)^2} - \frac{1}{n(n+1)^2} && \\
      &\leq 2 - \frac{n(n+1)}{n(n+1)^2} &&\text{(lol)} \\
      &= 2 - \frac{1}{n+1}  
      \end{align*}
*** Prove that \( (1+2+3+\dotsb+n)^2 = 1^3 + 2^3 + 3^3 + \dotsb + n^3 \) for every \( n \in \mathbb{N}. \)
    - Basis step: \( 1^2 = 1^3. \)
    - Induction step:
      \begin{align*}
      \big( 1+2+3 &+\dotsb+(n+1) \big)^2 && \\
      &= (1+2+3+\dotsb+n)^2 + (n+1)^2 + 2(1+2+3+\dotsb+n)(n+1) && \\
      &= \sum_{k=1}^n k^3 + (n+1)\big( (n+1) + 2(1+2+3+\dotsb+n) \big) &&\text{(inductive hypothesis)} \\
      &= \sum_{k=1}^n k^3 + (n+1)\big( (n+1) + n(n+1) \big)   &&\text{(Gauss ftw)} \\
      &= \sum_{k=1}^n k^3 + (n+1)^3.
      \end{align*}
*** If \( n \in \mathbb{N}, \) then \( \frac{1}{1} + \frac{1}{2} + \frac{1}{3} + \frac{1}{4} + \frac{1}{5} + \dotsb + \frac{1}{2^n -1} + \frac{1}{2^n} \geq 1 + \frac{n}{2}. \)
    - Basis step: \( 1+\frac{1}{2} = 1 + \frac{1}{2}. \)
    - Inductive step: 
      \begin{align*}
      \sum_{k=1}^{2^{n+1}} &=  \sum_{k=1}^{2^n} \frac{1}{k} + \sum_{k=2^n +1}^{2^{n+1}} \frac{1}{k} && \\
      &\geq  1 + \frac{n}{2} + \sum_{k=2^n +1}^{2^{n+1}} \frac{1}{k} &&\text{(inductive hypothesis)} \\
      &= 1 + \frac{n}{2} + \left( \frac{1}{2^n+1} + \frac{1}{2^n+2} + \dotsb + \frac{1}{2^n+2^n} \right) && \\
      &\geq 1 + \frac{n}{2} + \left( \frac{1}{2^{n+1}} + \frac{1}{2^{n+1}} + \dotsb + \frac{1}{2^{n+1}} \right) &&\text{(lol)} \\
      &= 1+ \frac{n}{2}+ \frac{1}{2}
      \end{align*}
*** If \( n \in \mathbb{N}, \) then \( \big( 1-\frac{1}{2} \big) \big( 1-\frac{1}{4} \big) \big( 1-\frac{1}{8} \big) \big( 1-\frac{1}{16} \big) \dotsb \big( 1-\frac{1}{2^n} \big) \geq \frac{1}{4} + \frac{1}{2^{n+1}}. \)
    - Basis step: \( \big( 1 - \tfrac{1}{2} \big) = \tfrac{1}{4} + \tfrac{1}{4}. \)
    - Inductive step: 
      \begin{align*}
      \prod_{k=1}^{n+1} \big( 1 - \tfrac{1}{2^k} \big) &= \big( 1 - \tfrac{1}{2^{n+1}} \big) \prod_{k=1}^n \big( 1 -
      \tfrac{1}{2^k} \big) && \\
      &\geq \big( 1 - \tfrac{1}{2^{n+1}} \big) \big( \tfrac{1}{4} + \tfrac{1}{2^{n+1}} \big) &&\text{(inductive hypothesis)} \\
      &= \tfrac{1}{4} + \tfrac{1}{2^{n+1}} - \tfrac{1}{2^{n+3}} - \tfrac{1}{2^{2n+2}} && \\
      &= \tfrac{1}{4} + \tfrac{2^{n+1}-1}{2^{2n+2}} - \tfrac{1}{2^{n+3}} &&\text{(gather terms 2 and 4 together)} \\
      &\geq \tfrac{1}{4} - \tfrac{1}{2^{n+3}} = \tfrac{1}{4} - \tfrac{1}{2} \cdot \tfrac{1}{2^{n+2}} &&\text{(lol)} \\
      &\geq \tfrac{1}{4} - \tfrac{1}{2^{n+2}} &&\text{(more lol)}
      \end{align*}
*** TODO Use mathematical induction to prove the binomial theorem (use equation (3.2) on page 78.)
*** Prove that \( \sum_{k=1}^n k \binom{n}{k} = n 2^{n-1} \) for each natural number \( n. \)
    - Basis step: \( 1\cdot \binom{1}{1} = 1 = 1\cdot 2^{1-1}. \)
    - Without using the inductive hypothesis, but trying for something similar to the approach of the inductive step.
      \begin{align*}
      \sum_{k=1}^{n+1} k \binom{n+1}{k} &= \sum_{k=1}^{n+1} k \frac{(n+1)!}{k! (n+1-k)!} &&\text{(formula)} \\
      &= (n+1) \sum_{k=1}^{n+1} \frac{n!}{(k-1)!(n+1-k)!} &&\text{(factor out one }(n+1)\text{ there)} \\
      &= (n+1) \sum_{k=1}^{n+1} \binom{n}{k-1} &&\text{(formula again)} \\
      &= (n+1) \sum_{j=0}^n \binom{n}{j} &&\text{(change the index)} \\
      &= (n+1) 2^n &&\text{(since }2^n = (1+1)^n = \sum_{j=0}^n \tbinom{n}{j} \text{ trivially)}
      \end{align*}
    - Using the obvious trick with the derivative.  Set \( f(x) = (1+x)^n = \sum_{k=0}^n \tbinom{n}{k}x^k \).  The
      derivative gives \( n(1+x)^{n-1} = \sum_{k=1}^n k\tbinom{n}{k}x^{k-1}. \)  Evaluate the latter at \( x = 1 \) to
      get the desired result.
    - Matt indicated that the only way to get the inductive step is by using the recursive formula
      \begin{equation*}
      \sum_{k=1}^{n+1} k \binom{n+1}{k} = \sum_{k=1}^{n+1} k\binom{n}{k} + k\binom{n}{k-1} 
      = \underbrace{\sum_{k=1}^{n+1} k\binom{n}{k}}_{I} + \underbrace{\sum_{k=1}^{n+1} k\binom{n}{k-1}}_{II}
      \end{equation*}
      Let's check both of those terms:
      \begin{align*}
      I &= (n+1)\binom{n}{n+1} + \sum_{k=1}^n k\binom{n}{k} = n2^{n-1} \\
      II &= \sum_{j=0}^{n} (j+1)\binom{n}{j} = \sum_{j=0}^n j \binom{n}{j} + \sum_{j=0}^n \binom{n}{j} = n2^{n-1} + 2^n
      \end{align*}
      This gives then \( \sum_{k=1}^{n+1} k\tbinom{n}{k} = (2n+2)2^{n-1} = (n+1)2^n. \)
*** Concerning the Fibonacci sequence, prove that \( F_1 + F_2 + F_3 + F_4 + \dotsb + F_n = F_{n+2}-1. \)
    - Some Fibonacci terms for the next problems

    #+NAME: fibonacci
    #+BEGIN_SRC python 
    from sympy import fibonacci
    return [(k,fibonacci(k)) for k in range(20)]
    #+END_SRC

    #+RESULTS: fibonacci
    |  0 |    0 |
    |  1 |    1 |
    |  2 |    1 |
    |  3 |    2 |
    |  4 |    3 |
    |  5 |    5 |
    |  6 |    8 |
    |  7 |   13 |
    |  8 |   21 |
    |  9 |   34 |
    | 10 |   55 |
    | 11 |   89 |
    | 12 |  144 |
    | 13 |  233 |
    | 14 |  377 |
    | 15 |  610 |
    | 16 |  987 |
    | 17 | 1597 |
    | 18 | 2584 |
    | 19 | 4181 |

    - Basis step: \( F_1 = 1, F_3-1 = 2-1. \)
    - Inductive step:
      \begin{equation*}
      \sum_{k=1}^{n+1} F_k = F_{n+1} + \sum_{k=1}^n F_k
      = F_{n+1} + \underbrace{F_{n+2} - 1}_{\text{inductive hyp.}}
      = \underbrace{F_{n+3}}_{F_{n+1}+F_{n+2}} - 1 
      \end{equation*}
*** Concerning the Fibonacci sequence, prove that \( \sum_{k=1}^n F_k^2 = F_n F_{n+1}. \)
    - Basis step: \( F_1 = 1, F_1 F_2 = 1. \)
    - Inductive step:
      \begin{equation*}
      \sum_{k=1}^{n+1} F_k^2 = F_{n+1}^2 + \sum_{k=1}^n F_n^2 = F_{n+1}^2 + F_n F_{n+1} = F_{n+1}\big( F_{n+1} + F_n
      \big) = F_{n+1} F_{n+2}.
      \end{equation*}
*** Concerning the Fibonacci sequence, prove that \( F_1 + F_3 + F_5 + F_7 + \dotsb + F_{2n-1} = F_{2n}. \)
    - Basis step: \( F_2 = F_1 = 1. \)
    - Inductive step:
      \begin{equation*}
      \sum_{k=1}^{n+1} F_{2k-1} = F_{2n+1} + \sum_{k=1}^n F_{2k-1} = F_{2n+1} + F_{2n} = F_{2n+2}. 
    \end{equation}
