FA18/MA300/induction.tex
\item Concerning the Fibonacci sequence, prove that \(F_2 + F_4 + F_6 + F_8 + \dotsb + F_{2n} = F_{2n+1}-1.\)
\label{sec:orgc33f414}
\begin{itemize}
\item Basis step: \(F_2 = 1, F_3-1=2-1=1.\)
\item Inductive step: 
\begin{equation*}
\sum_{k=1}^{n+1} F_{2k} = F_{2n+2} + \sum_{k=1}^n F_{2k} = F_{2n+2} + F_{2n+1} - 1 = F_{2n+3} - 1
\end{equation*}
\end{itemize}
\item {\bfseries\sffamily TODO} In this problem \(n \in \mathbb{N}\) and \(F_n\) is the \(n\)th Fibonacci number.  Prove that
\label{sec:orgbd4d5f2}
\begin{equation*}
\binom{n}{0} + \binom{n-1}{1} + \binom{n-2}{2} + \binom{n-3}{3} + \dotsb + \binom{0}{n} = F_{n+1}.
\end{equation*}
\begin{itemize}
\item Basis step: For \(n = 1, \binom{1}{0} + \binom{0}{1} = 1 = F_2.\)
\item For reference, the inductive hypothesis could be written in compact form as \(\sum{k=0}^n \binom{n-k}{k} =
      F_{n+1}.\)
\item Inductive step:
\begin{align*}
\sum_{k=0}^{n+1} \binom{n+1-k}{k} &= \sum_{k=0}^{n+1} \binom{n-k}{k} + \binom{n-k}{k-1}  \\
&= \left( \binom{-1}{n+1} + \sum_{k=0}^n \binom{n-k}{k} \right) + \left( \dotsb \right) \\
\end{align*}
\end{itemize}
\item Here \(F_n\) is the \(n\)th Fibonacci number.  Prove that
\label{sec:orgd265aa0}
\begin{equation*}
F_n = \frac{\phi_1^n - \phi_2^n}{\sqrt{5}}, \text{ where } \phi_1 = \frac{1+\sqrt{5}}{2} \text{ and } \phi_2 =
\frac{1-\sqrt{5}}{2}.
\end{equation*}
\item {\bfseries\sffamily TODO} Prove that \(\sum_{k=0}^n \binom{k}{r} = \binom{n+1}{r+1},\) where \(1 \leq r \leq n.\)
\label{sec:org2fb5b90}
\item {\bfseries\sffamily TODO} Prove that the number of \(n\)-digit binary numbers that have no consecutive 1's is the Fibonacci number \(F_{n+2}.\)
\label{sec:org61435c9}
\begin{itemize}
\item Basis step: The number of 1-digit binary numbers that have no consecutive 1's is 2 (0 and 1). \(F_3=2.\)
\item Assume that the number of n-digit binary numbers that have no consecutive 1's is \(F_{n+2}\).
\item Induction step: Consider (n+1)-digit binary numbers.  We can construct them from the previous n-digit binary
numbers by appending an extra 1 at the beginning.  How many can we add?  All of the previous ones that start with
a zero:\ldots{}
\end{itemize}
\item Suppose \(n\) straight lines lie on a plane in such a way that no two of the lines are parallel, and no three of the lines intersect at a single point.  Show that this arrangement divides the plane into \(\frac{n^2+n+2}{2}\) regions.
\label{sec:org4517067}
\item Prove that \(3^1 + 3^2 + 3^3 + 3^4 + \dotsb + 3^n = \frac{3^{n+1}-3}{2}\) for every \(n \in \mathbb{N}.\)
\label{sec:org51e706c}
\begin{itemize}
\item Basis step: \(3^1 = 3. \tfrac{3^2-3}{2}=\tfrac{6}{2}=3.\)
\item Inductive step:
\begin{equation*}
\sum_{k=1}^{n+1} 3^k = 3^{n+1} + \sum_{k=1}^n 3^k = 3^{n+1} + \frac{3^{n+1}-3}{2} = \frac{2\cdot 3^{n+1} +
3^{n+1} - 3}{2} = \frac{3^{n+2}-3}{2}.
\end{equation*}
\end{itemize}
\item Prove that if \(n,k \in \mathbb{N},\) and \(n\) is even and \(k\) is odd, then \(\binom{n}{k}\) is even.
\label{sec:orgbc60f72}
\item Prove that if \(n = 2^k-1\) for some \(k \in \mathbb{N},\) then every entry in the \(n\)th row of Pascal's triangle is odd.
\label{sec:org4e024f3}
\item Prove that if \(m,n \in \mathbb{N},\) then \(\sum_{k=0}^n k \binom{m+k}{m} = n \binom{m+n+1}{m+1} - \binom{m+n+1}{m+2}.\)
\label{sec:org6fa626b}
\item Prove that if \(n\) is a positive integer, then \(\binom{n}{0}^2 + \binom{n}{1}^2 + \binom{n}{2}^2 + \dotsb + \binom{n}{n}^2 = \binom{2n}{n}.\)
\label{sec:org2275f0f}
\item Prove that if \(n\) is a positive integer, then \(\binom{n+0}{0} + \binom{n+1}{1} + \binom{n+2}{2} + \dotsb + \binom{n+k}{n} = \binom{n+k+1}{k}.\)
\label{sec:org481d295}
\item Prove that \(\sum_{k=0}^p \binom{m}{k} \binom{n}{p-k} = \binom{m+n}{p}\) for positive integers \(m, n\) and \(p.\).
\label{sec:org6b356f8}
\item Prove that \(\sum_{k=0}^m \binom{m}{k} \binom{n}{p+k} = \binom{m+n}{m+p}\) for positive integers \(m, n\) and \(p.\).
\label{sec:orgf932909}
\end{enumerate}
\end{document}